---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallStructureIdParam
source: html/94d6534c-7595-d3ce-c7af-fee44c9ea64e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId WallStructureIdParam { get; }
```